#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

[0m[1mgoogle_service_account.github_action_sa: Refreshing state... [id=projects/polar-processor-382521/serviceAccounts/github-action-sa@polar-processor-382521.iam.gserviceaccount.com][0m
[0m[1mgoogle_service_account.dataflow_sa: Refreshing state... [id=projects/polar-processor-382521/serviceAccounts/dataflow-sa@polar-processor-382521.iam.gserviceaccount.com][0m
[0m[1mgoogle_pubsub_topic.topic_no_schema: Refreshing state... [id=projects/polar-processor-382521/topics/topic-no-schema][0m
[0m[1mgoogle_storage_bucket.default: Refreshing state... [id=john-nguyen-gcp-bucket-tfstate][0m
[0m[1mgoogle_pubsub_subscription.topic_no_schema_subscription: Refreshing state... [id=projects/polar-processor-382521/subscriptions/topic-no-schema-sub][0m
[0m[1mgoogle_project_iam_member.github_action_sa_iam_binding: Refreshing state... [id=polar-processor-382521/roles/editor/serviceAccount:github-action-sa@polar-processor-382521.iam.gserviceaccount.com][0m
[0m[1mgoogle_storage_bucket_iam_member.github_action_sa_tfstate_binding: Refreshing state... [id=b/john-nguyen-gcp-bucket-tfstate/roles/storage.admin/serviceAccount:github-action-sa@polar-processor-382521.iam.gserviceaccount.com][0m
[0m[1mgoogle_pubsub_subscription_iam_binding.topic_no_schema_dataflow_subscription_iam_binding: Refreshing state... [id=projects/polar-processor-382521/subscriptions/topic-no-schema-sub/roles/editor][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # google_pubsub_subscription.topic_no_schema_subscription[0m has been deleted
[0m  [31m-[0m[0m resource "google_pubsub_subscription" "topic_no_schema_subscription" {
        id                           = "projects/polar-processor-382521/subscriptions/topic-no-schema-sub"
      [31m-[0m[0m name                         = "topic-no-schema-sub" [90m-> null[0m[0m
        [90m# (8 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # google_project_service.cloud-build[0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "cloud-build" {
      [32m+[0m[0m disable_on_destroy = true
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "polar-processor-382521"
      [32m+[0m[0m service            = "cloudbuild.googleapis.com"
    }

[1m  # google_project_service.cloud-functions[0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "cloud-functions" {
      [32m+[0m[0m disable_on_destroy = true
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "polar-processor-382521"
      [32m+[0m[0m service            = "cloudfunctions.googleapis.com"
    }

[1m  # google_pubsub_subscription.topic_no_schema_subscription[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_subscription" "topic_no_schema_subscription" {
      [32m+[0m[0m ack_deadline_seconds       = 20
      [32m+[0m[0m enable_message_ordering    = false
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m message_retention_duration = "1200s"
      [32m+[0m[0m name                       = "topic-no-schema-sub"
      [32m+[0m[0m project                    = "polar-processor-382521"
      [32m+[0m[0m topic                      = "topic-no-schema"

      [32m+[0m[0m expiration_policy {
          [32m+[0m[0m ttl = "300000.5s"
        }

      [32m+[0m[0m retry_policy {
          [32m+[0m[0m maximum_backoff = (known after apply)
          [32m+[0m[0m minimum_backoff = "10s"
        }
    }

[1m  # google_pubsub_subscription_iam_binding.topic_no_schema_dataflow_subscription_iam_binding[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_subscription_iam_binding" "topic_no_schema_dataflow_subscription_iam_binding" {
      [32m+[0m[0m etag         = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m members      = [
          [32m+[0m[0m "serviceAccount:dataflow-sa@polar-processor-382521.iam.gserviceaccount.com",
        ]
      [32m+[0m[0m project      = (known after apply)
      [32m+[0m[0m role         = "roles/editor"
      [32m+[0m[0m subscription = "topic-no-schema-sub"
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @nguy4130, Action: `pull_request`*